// Define schedulе
new Vue({
  el: '#schedule',
  data() {
    return {
      schedule: [
        {
          day: 'Понеделник',
          subjects: [
            {
              time: '8:00 - 8:45',
              subject: 'Час на класа',
            },
            {
              time: '9:05 - 9:50',
              subject: 'УП-К и Д / Програмиране',
            },
            {
              time: '10:00 - 10:45',
              subject: 'УП-К и Д / Програмиране',
            },
            {
              time: '10:55 - 11:40',
              subject: 'Български език',
            },
            {
              time: '11:50 - 12:35',
              subject: 'КМ',
            },
            {
              time: '12:45 - 13:30',
              subject: 'Физическо',
            },
            {
              time: '13:35 - 14:20',
              subject: 'СВОБОДЕН / УП - КПС',
            },
            {
              time: '14:25 - 15:10',
              subject: 'СВОБОДЕН / УП - КПС',
            },
          ],
        },
        {
          day: 'Вторник',
          subjects: [
            {
              time: '8:00 - 8:45',
              subject: 'КМ',
            },
            {
              time: '9:05 - 9:50',
              subject: 'математика',
            },
            {
              time: '10:00 - 10:45',
              subject: 'КС  РПП',
            },
            {
              time: '10:55 - 11:40',
              subject: 'Английски език',
            },
            {
              time: '11:50 - 12:35',
              subject: 'Физическо',
            },
            {
              time: '12:45 - 13:30',
              subject: 'Руски език',
            },
            {
              time: '13:35 - 14:20',
              subject: 'УП - КПС / СВОБОДЕН',
            },
            {
              time: '14:25 - 15:10',
              subject: 'УП-КПС / СВОБОДЕН',
            },
          ],
        },
        {
          day: 'Сряда',
          subjects: [
            {
              time: '8:00 - 8:45',
              subject: 'Български език',
            },
            {
              time: '9:05 - 9:50',
              subject: 'Български език',
            },
            {
              time: '10:00 - 10:45',
              subject: 'УП-КПС / УП-К и Д',
            },
            {
              time: '10:55 - 11:40',
              subject: 'УП-КПС / УП-К и Д',
            },
            {
              time: '11:50 - 12:35',
              subject: 'УП-КПС / УП-К и Д',
            },
            {
              time: '12:45 - 13:30',
              subject: 'Английски език',
            },
          ],
        },
        {
          day: 'Четвъртък',
          subjects: [
            {
              time: '8:00 - 8:45',
              subject: 'Програмиране / УП-К и Д',
            },
            {
              time: '9:05 - 9:50',
              subject: 'Програмиране / УП-К и Д',
            },
            {
              time: '10:00 - 10:45',
              subject: 'УП-К и Д / УП-КПС',
            },
            {
              time: '10:55 - 11:40',
              subject: 'УП-К и Д / УП-КПС',
            },
            {
              time: '11:50 - 12:35',
              subject: 'УП-К и Д / УП-КПС',
            },
            {
              time: '12:45 - 13:30',
              subject: 'Математика',
            },
            {
              time: '13:35 - 14:20',
              subject: 'Руски език',
            },
            {
              time: '14:45 - 16:15',
              subject: 'Спортни дейности',
            },
          ],
        },
        {
          day: 'Петък',
          subjects: [
            {
              time: '8:00 - 8:45',
              subject: 'ПС / УП-КПС',
            },
            {
              time: '9:05 - 9:50',
              subject: 'ПС / УП-КПС',
            },
            {
              time: '10:00 - 10:45',
              subject: 'УП-КПС / ПС',
            },
            {
              time: '10:55 - 11:40',
              subject: 'УП-КПС / ПС',
            },
            {
              time: '11:50 - 12:35',
              subject: 'Български език    ИУЧ',
            },
            {
              time: '12:45 - 13:30',
              subject: 'Гражданско образование',
            },
          ],
        },
      ],
    };
  },
  created: function () {
    fetch('./schedule.json')
      .then((response) => response.json())
      .then((data) => {
        this.schedule = data.schedule;
      });
  },
});
